In [1]:
import os

import cupy as cp
import pandas as pd
import cudf
import dask_cudf

cp.random.seed(12)

In [2]:
df = cudf.read_parquet('data/2000-01.parquet')

In [3]:
df.shape

(2592000, 5)

In [4]:
df.head()

                timestamp    id    name         x         y
index
0     2000-01-01 00:00:00   975   Frank  0.214951 -0.066426
1     2000-01-01 00:00:01  1039  Oliver -0.547168  0.230221
2     2000-01-01 00:00:02   990   Alice -0.777825 -0.867442
3     2000-01-01 00:00:03   972  Ursula  0.065803 -0.224570
4     2000-01-01 00:00:04  1035   Kevin  0.130403  0.604034

In [5]:
df.tail()

                timestamp    id     name         x         y
index
86395 2000-01-10 23:59:55   960  Norbert -0.738383  0.001738
86396 2000-01-10 23:59:56  1014    Laura -0.091394 -0.222904
86397 2000-01-10 23:59:57  1035   Yvonne -0.049637 -0.122041
86398 2000-01-10 23:59:58   976   Ingrid -0.384199 -0.099714
86399 2000-01-10 23:59:59  1011    Jerry -0.468021  0.477467

In [6]:
type(df)

cudf.core.dataframe.DataFrame

In [7]:
df.sort_values('name').head()

                timestamp    id   name         x         y
index
2     2000-01-01 00:00:02   990  Alice -0.777825 -0.867442
5     2000-01-01 00:00:05  1007  Alice -0.715288  0.467646
40    2000-01-01 00:00:40  1014  Alice -0.666317  0.456537
61    2000-01-01 00:01:01  1015  Alice -0.077106  0.327120
111   2000-01-01 00:01:51  1002  Alice -0.676069 -0.752535

In [8]:
len(df.index)

2592000

In [10]:
df['x'].mean()

-0.0003122162057010518

In [11]:
df['x'].count()

2592000

In [12]:
x_mean_by_name = df.groupby('name')['x'].mean()

In [13]:
x_mean_by_name.shape

(26,)

In [14]:
x_mean_by_name

name
Alice      -0.000451
Bob        -0.003964
Charlie    -0.003123
Dan         0.003863
Edith      -0.000875
Frank       0.001855
George     -0.000439
Hannah      0.000771
Ingrid      0.000342
Jerry       0.000512
Kevin      -0.001705
Laura       0.001074
Michael     0.000081
Norbert    -0.002193
Oliver     -0.001725
Patricia    0.000033
Quinn       0.000675
Ray        -0.000274
Sarah       0.000381
Tim        -0.002564
Ursula     -0.000375
Victor     -0.000221
Wendy       0.000914
Xavier      0.000232
Yvonne     -0.002146
Zelda       0.001200
Name: x, dtype: float64

In [25]:
df['name'].value_counts()

Jerry       100562
Wendy       100430
Michael     100274
Victor       99960
Oliver       99953
Bob          99939
Dan          99932
Kevin        99906
Alice        99859
Yvonne       99823
Hannah       99806
Edith        99781
Ray          99730
Zelda        99697
Patricia     99613
Sarah        99595
Ursula       99560
Quinn        99517
Norbert      99512
George       99454
Charlie      99433
Ingrid       99341
Laura        99329
Xavier       99159
Tim          99037
Frank        98798
Name: name, dtype: int32

In [19]:
df['z'] = df['x'] + 1

In [20]:
df['z'].mean()

0.9996877837942988

In [21]:
df['x'].mean()

-0.0003122162057010518

In [22]:
df['x'].mean() + df['z'].mean()

0.9993755675885977

In [23]:
df[df['z'] > 1].shape

(1295294, 6)

In [27]:
d = 1007
df.query('id == @d').shape

(31757, 6)